InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьУпаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыНоменклатуры</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принципал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатурыДляЦенообразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПолное</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СерииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерСерии</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКиЗГИСМ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерКиЗГИСМ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDTID</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDTID</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDUser</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDEPC</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDEPC</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EPCGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDМеткаНеЧитаемая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Справка2ЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредприятияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписьСкладскогоЖурналаВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПартииВЕТИС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяРозничнаяЦенаМОТП</Name>
					<Comment>Максимальная розничная цена (МОТП)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияНоменклатурыДляЦенообразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/УточнениеШтрихкодаНоменклатуры/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Форма предназначена для регистрации или уточнения номенклатуры в информационной базе по штрихкоду.
// Позволяет загружать найденную в сервисе номенклатуру в информационную базу.
//
// При открытии формы необходимо указать оповещения о закрытии формы, в которое будет передана структура с результатом
// работы формы.
//
// Параметры формы:
//	* ИмяТЧ - Строка - имя заполняемой табличной части. Значение по умолчанию - "Товары".
//	* ДействияСНеизвестнымиШтрихкодами - Строка - описание действие, которое необходимо выполнить с неизвестными штрихкодами.
//													Если указано значение "РегистрацияОбязательна", тогда ожидается, что
//													форма открыта с правом регистрации записей регистра, а элемент формы
//													Зарегистрировать скрывается.
//	* НеизвестныеШтрихкоды - Массив из Структура - коллекция штрихкодов номенклатуры, где:
//		** Штрихкод - Строка - штрихкод номенклатуры.
//		** Количество - Строка - количество номенклатуры.

#Область ОписаниеПеременных

&НаКлиенте
Перем ВыполняетсяЗакрытие; // Для передачи в обработчик ПередЗакрытием признак закрытия формы.

&НаКлиенте
Перем ЗадаватьВопросПередЗакрытием; // Для передачи в обработчик ПередЗакрытием признак необходимости вопроса.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Возврат при получении формы для анализа.
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	ИнициализироватьДанныеИНастроитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВыполняетсяЗакрытие				= Ложь;
	ЗадаватьВопросПередЗакрытием	= Истина;
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если ВводДоступен()
		И Источник = "ПодключаемоеОборудование" Тогда
		
		Если ИмяСобытия = "ScanData"
			И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			
			ОбработатьШтрихкоды(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр));
			
		КонецЕсли;
		
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не Зарегистрировать Тогда
		Возврат;
	КонецЕсли;
	
	РежимУказанияШтрихкода = Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаУточнениеШтрихкодаНоменклатуры;
	
	ПроверитьЗаполнениеСерии(Отказ, РежимУказанияШтрихкода);
	ПроверкаНеуникальныхШтрихкодовНоменклатуры(Отказ, РежимУказанияШтрихкода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы
		И ЗадаватьВопросПередЗакрытием Тогда
		
		Отказ = Истина;
		
		Если Зарегистрировать
			И НеуникальныеШтрихкодыНоменклатуры.Количество() = 0
			И Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаУточнениеШтрихкодаНоменклатуры Тогда
			
			ТекстПредупреждения = НСтр("ru = 'Регистрация штрихкода номенклатуры будет прервана.'");
			
		Иначе
			ТекстПредупреждения = НСтр("ru = 'Уточнение штрихкода номенклатуры будет прервано.'");
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ВыполняетсяЗакрытие
		И ЗадаватьВопросПередЗакрытием Тогда
		
		Отказ = Истина;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		
		Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаУточнениеШтрихкодаНоменклатуры Тогда
			ТекстВопроса = НСтр("ru = 'Товар не будет перенесен в документ.
				|Отложите его в сторону как неотсканированный.'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Товары не будут перенесены в документ.
				|Отложите их в сторону как неотсканированные.'");
		КонецЕсли;
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = ДанныеШтрихкода();
	
	ОбработкаДействийПриИзмененииНоменклатуры(ТекущаяСтрока);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ТекущаяСтрока, , "Штрихкод");
	ОбновитьРеквизитыНоменклатуры(ТекущаяСтрока);
	УстановитьДоступностьЭлементов(Элементы, РеквизитыНоменклатуры);
	ЗаполнитьСпискиВыбора(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)
	
	ИзмерениеПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СерияПриИзменении(Элемент)
	
	ИзмерениеПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УпаковкаПриИзменении(Элемент)
	
	ТекущаяСтрока = ?(ЗначениеЗаполнено(РеквизитыНоменклатуры), РеквизитыНоменклатуры, РеквизитыНоменклатуры());
	
	ИзмерениеПриИзменении(Элемент);
	ОбновитьРеквизитыНоменклатуры(ТекущаяСтрока);
	УстановитьДоступностьЭлементов(Элементы, РеквизитыНоменклатуры);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШтрихкодыНоменклатуры

&НаКлиенте
Процедура ШтрихкодыНоменклатурыПриАктивизацииЯчейки(Элемент)
	
	ИмяПоля = Элемент.ТекущийЭлемент.Имя;
	
	Если ИмяПоля = Элементы.ШтрихкодыНоменклатурыНоменклатура.Имя
		Или ИмяПоля = Элементы.ШтрихкодыНоменклатурыХарактеристика.Имя
		Или ИмяПоля = Элементы.ШтрихкодыНоменклатурыСерия.Имя
		Или ИмяПоля = Элементы.ШтрихкодыНоменклатурыУпаковка.Имя Тогда
		
		ЗаполнитьСпискиВыбора(ИмяПоля, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодыНоменклатурыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ШтрихкодыНоменклатуры.ТекущаяСтрока;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаДействийПриИзмененииНоменклатуры(ТекущаяСтрока, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодыНоменклатурыХарактеристикаПриИзменении(Элемент)
	
	ШтрихкодыНоменклатурыИзмерениеПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодыНоменклатурыСерияПриИзменении(Элемент)
	
	ШтрихкодыНоменклатурыИзмерениеПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодыНоменклатурыУпаковкаПриИзменении(Элемент)
	
	ШтрихкодыНоменклатурыИзмерениеПриИзменении();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ОчиститьСообщения();
	
	Отказ = Ложь;
	РежимУказанияШтрихкода = Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаУточнениеШтрихкодаНоменклатуры;
	
	ПроверитьЗаполнениеИнформацииОТоваре(Отказ, РежимУказанияШтрихкода);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализироватьШтрихкодыНоменклатурыДляПараметровЗакрытия(РежимУказанияШтрихкода);
	
	ПараметрЗакрытия = ПараметрыЗакрытияФормы(Отказ, РежимУказанияШтрихкода);
	
	ОчиститьШтрихкодыНоменклатурыДляПараметровЗакрытия(РежимУказанияШтрихкода);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрЗакрытия.НайденыНезарегистрированныеТовары Тогда
		ПараметрыОповещения	= Новый Структура("ПараметрЗакрытия", ПараметрЗакрытия);
		ОписаниеОповещения	= Новый ОписаниеОповещения("ПеренестиВДокументЗавершение", ЭтотОбъект, ПараметрыОповещения);
		
		ТекстВопроса = НСтр("ru = 'Не для всех штрихкодов указана информация о товарах.
			|Эти товары не будут перенесены в документ.
			|Отложите их в сторону как неотсканированные.'");
		
		Если РежимУказанияШтрихкода Тогда
			ТекстВопроса = НСтр("ru = 'Для штрихкода не указана информация о товаре.
				|Этот товар не будет перенесен в документ.
				|Отложите его в сторону как неотсканированный.'");
		КонецЕсли;
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
		Возврат;
	КонецЕсли;
	
	ПеренестиВДокументФрагмент(ПараметрЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(
		ЭтотОбъект,
		Элементы.ШтрихкодыНоменклатурыХарактеристика.Имя,
		"ШтрихкодыНоменклатуры.ХарактеристикиИспользуются");
	
	//
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатурыСклад") Тогда
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ШтрихкодыНоменклатурыСерия.Имя);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ШтрихкодыНоменклатуры.СерииИспользуются");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Ложь;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<серии не используются>'"));
		Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	КонецЕсли;
	
	//
	ДополнительныеПараметры = НоменклатураСервер.НовыеПараметрыУсловногоОформленияЕдиницИзмерения();
	ДополнительныеПараметры.ИмяПоляЕдиницаИзмерения	= Элементы.ШтрихкодыНоменклатурыЕдиницаИзмерения.Имя;
	ДополнительныеПараметры.ПутьКПолюУпаковка		= "ШтрихкодыНоменклатуры.Упаковка";
	
	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтотОбъект, ДополнительныеПараметры);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ШтрихкодыНоменклатурыЗарегистрирован.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ШтрихкодыНоменклатуры.Зарегистрирован");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Новый'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ШтрихкодыНоменклатурыЗарегистрирован.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ШтрихкодыНоменклатуры.Зарегистрирован");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Зарегистрирован'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.АктуальнаяПодпискаЦвет);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьДанныеИНастроитьФорму()
	
	ИмяТЧ					= Параметры.ИмяТЧ;
	НеизвестныеШтрихкоды	= НормализованныеНеизвестныеШтрихкоды();
	РежимУказанияШтрихкода	= НеизвестныеШтрихкоды.Количество() = 1;
	Зарегистрировать		= ШтрихкодированиеНоменклатурыСервер.ПравоРегистрацииШтрихкодовНоменклатурыДоступно();
	ИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры");
	
	ЗаполнитьНеуникальныеШтрихкодыНоменклатуры(НеизвестныеШтрихкоды);
	ЗаполнитьУточнениеШтрихкодаНоменклатуры(РежимУказанияШтрихкода, НеизвестныеШтрихкоды);
	ЗаполнитьШтрихкодыНоменклатуры(РежимУказанияШтрихкода, НеизвестныеШтрихкоды);
	НастроитьФорму(РежимУказанияШтрихкода);
	
КонецПроцедуры

&НаСервере
Функция НормализованныеНеизвестныеШтрихкоды()
	
	НеизвестныеШтрихкоды = ШтрихкодыНоменклатуры.Выгрузить(, "Штрихкод, Количество");
	НеизвестныеШтрихкоды.Колонки.Добавить("ШтрихкодНормализованный",
											Метаданные.РегистрыСведений.ШтрихкодыНоменклатуры.Измерения.Штрихкод.Тип);
	
	Для Каждого ДанныеШтрихкода Из Параметры.НеизвестныеШтрихкоды Цикл
		СтрокаТЧ = НеизвестныеШтрихкоды.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ДанныеШтрихкода);
		
		СтрокаТЧ.ШтрихкодНормализованный = ВРег(СокрЛП(ДанныеШтрихкода.Штрихкод));
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеШтрихкодов.Штрихкод					КАК Штрихкод,
	|	ДанныеШтрихкодов.ШтрихкодНормализованный	КАК ШтрихкодНормализованный,
	|	ДанныеШтрихкодов.Количество					КАК Количество
	|ПОМЕСТИТЬ НеизвестныеШтрихкоды
	|ИЗ
	|	&НеизвестныеШтрихкоды КАК ДанныеШтрихкодов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ДанныеШтрихкодов.Штрихкод)			КАК Штрихкод,
	|	ДанныеШтрихкодов.ШтрихкодНормализованный	КАК ШтрихкодНормализованный,
	|	СУММА(ДанныеШтрихкодов.Количество)			КАК Количество
	|ИЗ
	|	НеизвестныеШтрихкоды КАК ДанныеШтрихкодов
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеШтрихкодов.ШтрихкодНормализованный";
	
	Запрос.УстановитьПараметр("НеизвестныеШтрихкоды", НеизвестныеШтрихкоды);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НормализованныеНеизвестныеШтрихкоды = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		ДанныеШтрихкода = Новый Структура("Штрихкод, Количество");
		ЗаполнитьЗначенияСвойств(ДанныеШтрихкода, Выборка);
		
		НормализованныеНеизвестныеШтрихкоды.Добавить(ДанныеШтрихкода);
	КонецЦикла;
	
	Возврат НормализованныеНеизвестныеШтрихкоды;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНеуникальныеШтрихкодыНоменклатуры(НеизвестныеШтрихкоды)
	
	КэшированныеЗначения			= ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	НеЗакэшированныеРанееШтрихкоды	= Новый Массив;
	
	Для Каждого ДанныеШтрихкода Из НеизвестныеШтрихкоды Цикл
		НеЗакэшированныеРанееШтрихкоды.Добавить(ДанныеШтрихкода.Штрихкод);
	КонецЦикла;
	
	РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьДанныеПоШтрихкодамРасширенный(
		КэшированныеЗначения,
		НеЗакэшированныеРанееШтрихкоды,
		Истина);
	
	Для Каждого ДанныеКэша Из КэшированныеЗначения.Штрихкоды Цикл
		Если ТипЗнч(ДанныеКэша.Значение) <> Тип("Массив") Тогда
			Продолжить;
		Иначе
			КоллекцияИнформацииПоШтрихкоду = ДанныеКэша.Значение; // Массив Из см. ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения -
		КонецЕсли;
		
		Для Каждого ДанныеШтрихкода Из КоллекцияИнформацииПоШтрихкоду Цикл
			НоваяСтрока = НеуникальныеШтрихкодыНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеШтрихкода);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУточнениеШтрихкодаНоменклатуры(РежимУказанияШтрихкода, НеизвестныеШтрихкоды)
	
	Если Не РежимУказанияШтрихкода Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НеизвестныеШтрихкоды[0]);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШтрихкодыНоменклатуры(РежимУказанияШтрихкода, НеизвестныеШтрихкоды)
	
	Если РежимУказанияШтрихкода Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ДанныеШтрихкода Из НеизвестныеШтрихкоды Цикл
		СтрокаТЧ = ШтрихкодыНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ДанныеШтрихкода);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму(РежимУказанияШтрихкода)
	
	ЕстьНеуникальныеШтрихкоды = НеуникальныеШтрихкодыНоменклатуры.Количество() > 0;
	
	Заголовок		= НСтр("ru = 'Уточнение штрихкода номенклатуры'");
	ТекстПояснения	= НСтр("ru = 'По штрихкоду найдено несколько товаров. Выберите товар, соответствующий штрихкоду.'");
	
	Если Зарегистрировать
		И РежимУказанияШтрихкода
		И Не ЕстьНеуникальныеШтрихкоды Тогда
		
		Заголовок = НСтр("ru = 'Регистрация штрихкода номенклатуры'");
		
	КонецЕсли;
	
	Если Не РежимУказанияШтрихкода Тогда
		ТекстПояснения = НСтр("ru = 'Товар по штрихкоду не определен. Укажите товар, соответствующий штрихкоду.'");
	ИначеЕсли Не ЕстьНеуникальныеШтрихкоды Тогда
		ТекстПояснения = НСтр("ru = 'Товар по штрихкоду не найден. Укажите товар, соответствующий штрихкоду.'");
	КонецЕсли;
	
	ВидимостьПризнакаРегистрации = Зарегистрировать
									И Параметры.ДействияСНеизвестнымиШтрихкодами <> "РегистрацияОбязательна";
	
	Элементы.ПояснениеКФорме.Заголовок						= ТекстПояснения;
	Элементы.ГруппаСтраницы.ТекущаяСтраница					= ?(РежимУказанияШтрихкода,
																Элементы.ГруппаУточнениеШтрихкодаНоменклатуры,
																Элементы.ГруппаШтрихкодыНоменклатуры);
	Элементы.ГруппаУточнениеШтрихкодаНоменклатуры.Видимость	= РежимУказанияШтрихкода;
	Элементы.ГруппаШтрихкодыНоменклатуры.Видимость			= Не РежимУказанияШтрихкода;
	Элементы.ЗарегистрироватьШтрихкод.Видимость				= ВидимостьПризнакаРегистрации;
	Элементы.ЗарегистрироватьШтрихкоды.Видимость			= ВидимостьПризнакаРегистрации;
	
	Если РежимУказанияШтрихкода Тогда
		ФорматЗарегистрирован = НСтр("ru = 'БЛ=''Новый''; БИ=''Зарегистрирован'''");
		
		Элементы.Состояния.Формат		= ФорматЗарегистрирован;
		Элементы.Состояния.ЦветТекста	= ЦветаСтиля.ЦветОсобогоТекста;
		
		УстановитьДоступностьЭлементов(Элементы, РеквизитыНоменклатуры());
	Иначе
		Элементы.ПояснениеКФорме.МаксимальнаяШирина = 0;
	КонецЕсли;
	
	ИнициализироватьСписокВыбораНоменклатуры(РежимУказанияШтрихкода, ЕстьНеуникальныеШтрихкоды);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСписокВыбораНоменклатуры(РежимУказанияШтрихкода, ЕстьНеуникальныеШтрихкоды)
	
	Если Не (РежимУказанияШтрихкода
		И ЕстьНеуникальныеШтрихкоды) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СписокВыбораНоменклатуры = Элементы.Номенклатура.СписокВыбора;
	СписокВыбораНоменклатуры.Очистить();
	
	Для Каждого ДанныеШтрихкода Из НеуникальныеШтрихкодыНоменклатуры Цикл
		ЗаполнитьСписокЗначением(СписокВыбораНоменклатуры, ДанныеШтрихкода.Номенклатура);
	КонецЦикла;
	
	Элементы.Номенклатура.ИсторияВыбораПриВводе = ?(СписокВыбораНоменклатуры.Количество() > 0,
													ИсторияВыбораПриВводе.НеИспользовать,
													ИсторияВыбораПриВводе.Авто);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСписокЗначением(СписокВыбора, ЗначениеСписка)
	
	Если ЗначениеЗаполнено(ЗначениеСписка)
		И СписокВыбора.НайтиПоЗначению(ЗначениеСписка) = Неопределено Тогда
		
		СписокВыбора.Добавить(ЗначениеСписка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РеквизитыНоменклатуры()
	
	УпаковкаЕдиницаИзмеренияПоУмолчанию	= ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка");
	
	РеквизитыНоменклатурыШаблон = Новый Структура;
	РеквизитыНоменклатурыШаблон.Вставить("ХарактеристикиИспользуются",	Ложь);
	РеквизитыНоменклатурыШаблон.Вставить("СерииИспользуются",			Ложь);
	РеквизитыНоменклатурыШаблон.Вставить("Упаковка",					УпаковкаЕдиницаИзмеренияПоУмолчанию);
	РеквизитыНоменклатурыШаблон.Вставить("ЕдиницаИзмерения",			УпаковкаЕдиницаИзмеренияПоУмолчанию);
	
	Возврат РеквизитыНоменклатурыШаблон;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементов(Элементы, РеквизитыНоменклатуры)
	
	ХарактеристикаПодсказкаВвода	= ?(Не РеквизитыНоменклатуры.ХарактеристикиИспользуются,
										НСтр("ru = '<характеристики не используются>'"),
										"");
	СерияПодсказкаВвода				= ?(Не РеквизитыНоменклатуры.СерииИспользуются,
										НСтр("ru = '<серии не используются>'"),
										"");
	УпаковкаПодсказкаВвода			= ?(Не ЗначениеЗаполнено(РеквизитыНоменклатуры.Упаковка),
										Строка(РеквизитыНоменклатуры.ЕдиницаИзмерения),
										"");
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
																	"Характеристика",
																	"Доступность",
																	РеквизитыНоменклатуры.ХарактеристикиИспользуются);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
																	"Характеристика",
																	"ПодсказкаВвода",
																	ХарактеристикаПодсказкаВвода);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
																	"Серия",
																	"Доступность",
																	РеквизитыНоменклатуры.СерииИспользуются);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
																	"Серия",
																	"ПодсказкаВвода",
																	СерияПодсказкаВвода);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
																	"Упаковка",
																	"ПодсказкаВвода",
																	УпаковкаПодсказкаВвода);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкодов)
	
	ОтборСтрок				= Новый Структура("Штрихкод");
	РежимУказанияШтрихкода	= Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаУточнениеШтрихкодаНоменклатуры;
	
	Для Каждого ДанныеШтрихкода Из ДанныеШтрихкодов Цикл
		Если РежимУказанияШтрихкода Тогда
			Если Штрихкод = ДанныеШтрихкода.Штрихкод Тогда
				Количество = Количество + ДанныеШтрихкода.Количество;
			КонецЕсли;
		Иначе
			ЗаполнитьЗначенияСвойств(ОтборСтрок, ДанныеШтрихкода);
			НайденныеСтроки = ШтрихкодыНоменклатуры.НайтиСтроки(ОтборСтрок);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				НайденныеСтроки[0].Количество = НайденныеСтроки[0].Количество + ДанныеШтрихкода.Количество;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеСерии(Отказ, РежимУказанияШтрихкода)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатурыСклад") Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимУказанияШтрихкода
		И Не (Не Зарегистрирован
			И ЗначениеЗаполнено(Серия)) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	РегистрыСведений.ШтрихкодыНоменклатуры.ПроверитьЗаполнениеСерии(ШтрихкодыНоменклатуры, Отказ, РежимУказанияШтрихкода);
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаНеуникальныхШтрихкодовНоменклатуры(Отказ, РежимУказанияШтрихкода)
	
	Если Зарегистрирован
		И РежимУказанияШтрихкода Тогда
		
		Возврат;
		
	КонецЕсли;
	
	РегистрыСведений.ШтрихкодыНоменклатуры.ПроверкаНеуникальныхШтрихкодовНоменклатуры(
		ШтрихкодыНоменклатуры,
		Отказ,
		РежимУказанияШтрихкода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда
		ВыполняетсяЗакрытие = Истина;
		
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеШтрихкода()
	
	РеквизитыШтрихкода =
		"Зарегистрирован,
		|Штрихкод,
		|Номенклатура,
		|Характеристика,
		|ХарактеристикиИспользуются,
		|СерииИспользуются,
		|Серия,
		|Упаковка,
		|ЕдиницаИзмерения";
	
	ДанныеШтрихкода = Новый Структура(РеквизитыШтрихкода);
	ЗаполнитьЗначенияСвойств(ДанныеШтрихкода, ЭтотОбъект);
	
	Возврат ДанныеШтрихкода;
	
КонецФункции

&НаСервере
Процедура ОбработкаДействийПриИзмененииНоменклатуры(ДанныеШтрихкода, РежимУказанияШтрихкода = Истина)
	
	Если РежимУказанияШтрихкода Тогда
		ТекущаяСтрока = ДанныеШтрихкода;
	Иначе
		ТекущаяСтрока = ШтрихкодыНоменклатуры.НайтиПоИдентификатору(ДанныеШтрихкода);
	КонецЕсли;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу",	ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ПроверитьСериюПоВладельцу",				ТекущаяСтрока.Серия);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу",	ТекущаяСтрока.Упаковка);
	СтруктураДействий.Вставить("ПроверитьРегистрациюШтрихкода",			ТекущаяСтрока.Зарегистрирован);
	
	Если РежимУказанияШтрихкода Тогда
		ЗаполнитьПризнакЕдиницаИзмерения = Новый Структура("Номенклатура", "ЕдиницаИзмерения");
		
		СтруктураДействий.Вставить("ЗаполнитьПризнакЕдиницаИзмерения", ЗаполнитьПризнакЕдиницаИзмерения);
	КонецЕсли;
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
	
	НастроитьПоляРегистрации(ТекущаяСтрока, РежимУказанияШтрихкода);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьПоляРегистрации(ТекущаяСтрока, РежимУказанияШтрихкода)
	
	Если РежимУказанияШтрихкода Тогда
		Зарегистрирован = ТекущаяСтрока.Зарегистрирован;
		
		Элементы.Состояния.ЦветТекста = ?(Зарегистрирован,
											ЦветаСтиля.АктуальнаяПодпискаЦвет,
											ЦветаСтиля.ЦветОсобогоТекста);
	ИначеЕсли ТекущаяСтрока.Зарегистрирован Тогда
		ТекущаяСтрока.ЗарегистрированОбработкой = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРеквизитыНоменклатуры(ДанныеНоменклатуры)
	
	РеквизитыНоменклатурыШаблон = РеквизитыНоменклатуры();
	ЗаполнитьЗначенияСвойств(РеквизитыНоменклатурыШаблон, ДанныеНоменклатуры);
	ЗаполнитьЗначенияСвойств(РеквизитыНоменклатурыШаблон, ЭтотОбъект);
	
	РеквизитыНоменклатуры = Новый ФиксированнаяСтруктура(РеквизитыНоменклатурыШаблон);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмерениеПриИзменении(Элемент)
	
	ПроверитьРегистрациюШтрихкода(ДанныеШтрихкода());
	ЗаполнитьСпискиВыбора(Элемент.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьРегистрациюШтрихкода(ДанныеШтрихкода, РежимУказанияШтрихкода = Истина)
	
	Если РежимУказанияШтрихкода Тогда
		ТекущаяСтрока = ДанныеШтрихкода;
	Иначе
		ТекущаяСтрока = ШтрихкодыНоменклатуры.НайтиПоИдентификатору(ДанныеШтрихкода);
	КонецЕсли;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьРегистрациюШтрихкода", ТекущаяСтрока.Зарегистрирован);
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
	
	НастроитьПоляРегистрации(ТекущаяСтрока, РежимУказанияШтрихкода);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСпискиВыбора(ИмяПоля, РежимУказанияШтрихкода = Истина)
	
	Если НеуникальныеШтрихкодыНоменклатуры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимУказанияШтрихкода Тогда
		ТекущаяСтрока = ДанныеШтрихкода();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, РеквизитыНоменклатуры);
	Иначе
		ТекущаяСтрока = Элементы.ШтрихкодыНоменклатуры.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСписокНоменклатуры		= Ложь;
	ЗаполнитьСписокХарактеристики	= Ложь;
	ЗаполнитьСписокСерии			= Ложь;
	ЗаполнитьСписокУпаковки			= Ложь;
	
	ИмяПоляНоменклатура		= ?(РежимУказанияШтрихкода,
								Элементы.Номенклатура.Имя,
								Элементы.ШтрихкодыНоменклатурыНоменклатура.Имя);
	ИмяПоляХарактеристики	= ?(РежимУказанияШтрихкода,
								Элементы.Характеристика.Имя,
								Элементы.ШтрихкодыНоменклатурыХарактеристика.Имя);
	ИмяПоляСерия			= ?(РежимУказанияШтрихкода,
								Элементы.Серия.Имя,
								Элементы.ШтрихкодыНоменклатурыСерия.Имя);
	ИмяПоляУпаковки			= ?(РежимУказанияШтрихкода,
								Элементы.Упаковка.Имя,
								Элементы.ШтрихкодыНоменклатурыУпаковка.Имя);
	
	ПоляОтбора = Новый Массив;
	
	Если Не РежимУказанияШтрихкода Тогда
		ПоляОтбора.Добавить("Штрихкод");
	КонецЕсли;
	
	Если ИмяПоляНоменклатура = ИмяПоля Тогда
		Если Не РежимУказанияШтрихкода Тогда
			ЗаполнитьСписокНоменклатуры = Истина;
		ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
			ПоляОтбора.Добавить("Номенклатура");
			
			ЗаполнитьСписокХарактеристики	= ТекущаяСтрока.ХарактеристикиИспользуются;
			ЗаполнитьСписокСерии			= ТекущаяСтрока.СерииИспользуются;
			ЗаполнитьСписокУпаковки			= Истина;
		КонецЕсли;
	ИначеЕсли ИмяПоляХарактеристики = ИмяПоля Тогда
		Если Не РежимУказанияШтрихкода Тогда
			Если ТекущаяСтрока.ХарактеристикиИспользуются
				И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
				
				ПоляОтбора.Добавить("Номенклатура");
				
				ЗаполнитьСписокХарактеристики = Истина;
				
			КонецЕсли;
		Иначе
			ПоляОтбора.Добавить("Номенклатура");
			ПоляОтбора.Добавить("Характеристика");
			
			ЗаполнитьСписокСерии	= ТекущаяСтрока.СерииИспользуются;
			ЗаполнитьСписокУпаковки	= Истина;
		КонецЕсли;
	ИначеЕсли ИмяПоляСерия = ИмяПоля Тогда
		Если Не РежимУказанияШтрихкода Тогда
			Если ТекущаяСтрока.СерииИспользуются
				И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
				
				ПоляОтбора.Добавить("Номенклатура");
				ПоляОтбора.Добавить("Характеристика");
				
				ЗаполнитьСписокСерии = Истина;
				
			КонецЕсли
		Иначе
			ПоляОтбора.Добавить("Номенклатура");
			ПоляОтбора.Добавить("Характеристика");
			ПоляОтбора.Добавить("Серия");
			
			ЗаполнитьСписокУпаковки = Истина;
		КонецЕсли;
	Иначе
		Если Не РежимУказанияШтрихкода Тогда
			Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
				ПоляОтбора.Добавить("Номенклатура");
				ПоляОтбора.Добавить("Характеристика");
				ПоляОтбора.Добавить("Серия");
				
				ЗаполнитьСписокУпаковки = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не (ЗаполнитьСписокНоменклатуры
		Или ЗаполнитьСписокХарактеристики
		Или ЗаполнитьСписокСерии
		Или ЗаполнитьСписокУпаковки) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ЗаполнитьСписокНоменклатуры Тогда
		СписокВыбораНоменклатуры = Элементы[ИмяПоляНоменклатура].СписокВыбора;
		СписокВыбораНоменклатуры.Очистить();
	КонецЕсли;
	
	Если ЗаполнитьСписокХарактеристики Тогда
		СписокВыбораХарактеристик = Элементы[ИмяПоляХарактеристики].СписокВыбора;
		СписокВыбораХарактеристик.Очистить();
	КонецЕсли;
	
	Если ЗаполнитьСписокСерии Тогда
		СписокВыбораСерий = Элементы[ИмяПоляСерия].СписокВыбора;
		СписокВыбораСерий.Очистить();
	КонецЕсли;
	
	Если ЗаполнитьСписокУпаковки Тогда
		СписокВыбораУпаковок = Элементы[ИмяПоляУпаковки].СписокВыбора;
		СписокВыбораУпаковок.Очистить();
	КонецЕсли;
	
	СтрокиОтбора = НеуникальныеШтрихкодыНоменклатуры;
	
	Если ПоляОтбора.Количество() > 0 Тогда
		ИменаПолейОтбора = СтрСоединить(ПоляОтбора, ",");
		
		ОтборСтрок = Новый Структура(ИменаПолейОтбора);
		ЗаполнитьЗначенияСвойств(ОтборСтрок, ТекущаяСтрока);
		
		СтрокиОтбора = НеуникальныеШтрихкодыНоменклатуры.НайтиСтроки(ОтборСтрок);
	КонецЕсли;
	
	Для Каждого ДанныеШтрихкода Из СтрокиОтбора Цикл
		Если ЗаполнитьСписокНоменклатуры Тогда
			ЗаполнитьСписокЗначением(СписокВыбораНоменклатуры, ДанныеШтрихкода.Номенклатура);
		КонецЕсли;
		
		Если ЗаполнитьСписокХарактеристики Тогда
			ЗаполнитьСписокЗначением(СписокВыбораХарактеристик, ДанныеШтрихкода.Характеристика);
		КонецЕсли;
		
		Если ЗаполнитьСписокСерии Тогда
			ЗаполнитьСписокЗначением(СписокВыбораСерий, ДанныеШтрихкода.Серия);
		КонецЕсли;
		
		Если ЗаполнитьСписокУпаковки Тогда
			ЗаполнитьСписокЗначением(СписокВыбораУпаковок, ДанныеШтрихкода.Упаковка);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗаполнитьСписокНоменклатуры Тогда
		Элементы[ИмяПоляНоменклатура].ИсторияВыбораПриВводе = ?(СписокВыбораНоменклатуры.Количество() > 0,
																ИсторияВыбораПриВводе.НеИспользовать,
																ИсторияВыбораПриВводе.Авто);
	КонецЕсли;
	
	Если ЗаполнитьСписокХарактеристики Тогда
		Элементы[ИмяПоляХарактеристики].ИсторияВыбораПриВводе = ?(СписокВыбораХарактеристик.Количество() > 0,
																	ИсторияВыбораПриВводе.НеИспользовать,
																	ИсторияВыбораПриВводе.Авто);
	КонецЕсли;
	
	Если ЗаполнитьСписокСерии Тогда
		Элементы[ИмяПоляСерия].ИсторияВыбораПриВводе = ?(СписокВыбораСерий.Количество() > 0,
														ИсторияВыбораПриВводе.НеИспользовать,
														ИсторияВыбораПриВводе.Авто);
	КонецЕсли;
	
	Если ЗаполнитьСписокУпаковки Тогда
		Элементы[ИмяПоляУпаковки].ИсторияВыбораПриВводе = ?(СписокВыбораУпаковок.Количество() > 0,
															ИсторияВыбораПриВводе.НеИспользовать,
															ИсторияВыбораПриВводе.Авто);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодыНоменклатурыИзмерениеПриИзменении()
	
	ТекущаяСтрока = Элементы.ШтрихкодыНоменклатуры.ТекущаяСтрока;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьРегистрациюШтрихкода(ТекущаяСтрока, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеИнформацииОТоваре(Отказ, РежимУказанияШтрихкода)
	
	Если Не РежимУказанияШтрихкода Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Номенклатура"" не заполнено'");
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, Неопределено, "Номенклатура", "", Отказ);
	КонецЕсли;
	
	Если ИспользоватьХарактеристикиНоменклатуры
		И Не ЗначениеЗаполнено(Характеристика)
		И РеквизитыНоменклатуры <> Неопределено
		И РеквизитыНоменклатуры.ХарактеристикиИспользуются Тогда
		
		ТекстСообщения = НСтр("ru = 'Поле ""Характеристика"" не заполнено'");
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, Неопределено, "Характеристика", "", Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокументЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ПеренестиВДокументФрагмент(ДополнительныеПараметры.ПараметрЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокументФрагмент(ПараметрЗакрытия)
	
	ЗадаватьВопросПередЗакрытием	= Ложь;
	ПараметрЗакрытия.ФормаВладелец	= ВладелецФормы.УникальныйИдентификатор;
	
	Закрыть(ПараметрЗакрытия);
	Оповестить("НеизвестныеШтрихкоды", ПараметрЗакрытия, "ПодключаемоеОборудование");
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьШтрихкодыНоменклатурыДляПараметровЗакрытия(РежимУказанияШтрихкода)
	
	Если Не РежимУказанияШтрихкода Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТЧ = ШтрихкодыНоменклатуры.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаТЧ, ЭтотОбъект);
	ЗаполнитьЗначенияСвойств(СтрокаТЧ, РеквизитыНоменклатуры);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыЗакрытияФормы(Отказ, РежимУказанияШтрихкода)
	
	ПараметрЗакрытия = Новый Структура;
	ПараметрЗакрытия.Вставить("ОтложенныеТовары",					Новый Массив);
	ПараметрЗакрытия.Вставить("НайденыНезарегистрированныеТовары",	Ложь);
	ПараметрЗакрытия.Вставить("ЗарегистрированныеШтрихкоды",		Новый Массив);
	ПараметрЗакрытия.Вставить("ПолученыНовыеШтрихкоды",				Новый Массив);
	ПараметрЗакрытия.Вставить("ШтрихкодыНоменклатуры",				Новый Массив);
	ПараметрЗакрытия.Вставить("ФормаВладелец",						Неопределено);
	ПараметрЗакрытия.Вставить("ИмяТЧ",								ИмяТЧ);
	
	Если Зарегистрировать Тогда
		Если ПроверитьЗаполнение() Тогда
			ЗарегистрироватьШтрихкоды(Отказ)
		Иначе
			Отказ = Истина;
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат ПараметрЗакрытия;
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаШтрихкодов = ШтрихкодыНоменклатуры.Выгрузить();
	ТаблицаШтрихкодов.Индексы.Добавить("Зарегистрирован");
	
	Если Зарегистрировать Тогда
		ТаблицаШтрихкодов.Индексы.Добавить("ЗарегистрированОбработкой");
		ТаблицаШтрихкодов.Индексы.Добавить("Зарегистрирован, ЗарегистрированОбработкой");
		
		ОтборСтрок = Новый Структура("ЗарегистрированОбработкой", Истина);
		ПараметрЗакрытия.ЗарегистрированныеШтрихкоды = ШтрихкодыПоОтбору(ОтборСтрок, ТаблицаШтрихкодов);
		
		ОтборСтрок = Новый Структура("Зарегистрирован, ЗарегистрированОбработкой", Ложь, Ложь);
		ПараметрЗакрытия.ОтложенныеТовары = ШтрихкодыПоОтбору(ОтборСтрок, ТаблицаШтрихкодов);
		ПараметрЗакрытия.НайденыНезарегистрированныеТовары = ПараметрЗакрытия.ОтложенныеТовары.Количество() > 0;
	Иначе
		ПараметрЗакрытия.ОтложенныеТовары = ОтложенныеТовары(ТаблицаШтрихкодов);
		ПараметрЗакрытия.НайденыНезарегистрированныеТовары = ПараметрЗакрытия.ОтложенныеТовары.Количество() > 0;
	КонецЕсли;
	
	ОтборСтрок = Новый Структура("Зарегистрирован", Истина);
	ПараметрЗакрытия.ПолученыНовыеШтрихкоды = ШтрихкодыПоОтбору(ОтборСтрок, ТаблицаШтрихкодов);
	ПараметрЗакрытия.ШтрихкодыНоменклатуры = ДанныеПоШтрихкодам();
	
	Возврат ПараметрЗакрытия;
	
КонецФункции

&НаСервере
Процедура ЗарегистрироватьШтрихкоды(Отказ)
	
	ШтрихкодыДляОтработки	= ШтрихкодыНоменклатуры.Выгрузить().СкопироватьКолонки();
	СтрокиДляОтработки		= Новый Массив;
	
	Для Каждого ДанныеШтрихкода Из ШтрихкодыНоменклатуры Цикл
		Если ДанныеШтрихкода.Зарегистрирован
			Или Не ЗначениеЗаполнено(ДанныеШтрихкода.Номенклатура)
			Или (ИспользоватьХарактеристикиНоменклатуры
				И ДанныеШтрихкода.ХарактеристикиИспользуются
				И Не ЗначениеЗаполнено(ДанныеШтрихкода.Характеристика)) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ШтрихкодыДляОтработки.Добавить(), ДанныеШтрихкода);
		
		СтрокиДляОтработки.Добавить(ДанныеШтрихкода);
	КонецЦикла;
	
	Если ШтрихкодыДляОтработки.Количество() > 0 Тогда
		НачатьТранзакцию();
		
		Попытка
			РегистрацияШтрихкодовНоменклатуры(ШтрихкодыДляОтработки);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru = 'При записи штрихкодов произошла ошибка.
				|Дополнительное описание:
				|%1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		КонецПопытки;
		
		Для Каждого ДанныеШтрихкода Из СтрокиДляОтработки Цикл
			ДанныеШтрихкода.ЗарегистрированОбработкой = Истина;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РегистрацияШтрихкодовНоменклатуры(ШтрихкодыДляОтработки)
	
	РегистрыСведений.ШтрихкодыНоменклатуры.РегистрацияШтрихкодовНоменклатуры(ШтрихкодыДляОтработки);
	
КонецПроцедуры

&НаСервере
Функция ШтрихкодыПоОтбору(ОтборСтрок, ТаблицаШтрихкодов)
	
	ШтрихкодыПоОтбору	= Новый Массив;
	НайденныеСтроки		= ТаблицаШтрихкодов.НайтиСтроки(ОтборСтрок);
	
	Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
		ДанныеШтрихкода = Новый Структура("Штрихкод, Количество");
		ЗаполнитьЗначенияСвойств(ДанныеШтрихкода, СтрокаТЧ);
		
		ШтрихкодыПоОтбору.Добавить(ДанныеШтрихкода);
	КонецЦикла;
	
	Возврат ШтрихкодыПоОтбору;
	
КонецФункции

&НаСервере
Функция ОтложенныеТовары(ТаблицаШтрихкодов)
	
	ОтложенныеТовары	= Новый Массив;
	ОтборСтрок			= Новый Структура("Зарегистрирован", Ложь);
	НайденныеСтроки		= ТаблицаШтрихкодов.НайтиСтроки(ОтборСтрок);
	
	Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
		Если ПустаяСтрока(СтрокаТЧ.Штрихкод) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Номенклатура)
			Или (СтрокаТЧ.ХарактеристикиИспользуются
				И ИспользоватьХарактеристикиНоменклатуры
				И Не ЗначениеЗаполнено(СтрокаТЧ.Характеристика)) Тогда
			
			ДанныеШтрихкода = Новый Структура("Штрихкод, Количество");
			ЗаполнитьЗначенияСвойств(ДанныеШтрихкода, СтрокаТЧ);
			
			ОтложенныеТовары.Добавить(ДанныеШтрихкода);
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОтложенныеТовары;
	
КонецФункции

&НаСервере
Функция ДанныеПоШтрихкодам()
	
	ДанныеПоШтрихкодам = Новый Массив;
	
	Для Каждого СтрокаТЧ Из ШтрихкодыНоменклатуры Цикл
		Если Не ПустаяСтрока(СтрокаТЧ.Штрихкод)
			И ЗначениеЗаполнено(СтрокаТЧ.Номенклатура)
			И (Не СтрокаТЧ.ХарактеристикиИспользуются
				Или (СтрокаТЧ.ХарактеристикиИспользуются
					И ИспользоватьХарактеристикиНоменклатуры
					И ЗначениеЗаполнено(СтрокаТЧ.Характеристика))) Тогда
			
			ДанныеШтрихкода = ДанныеШтрихкодаПоУмолчанию();
			ЗаполнитьЗначенияСвойств(ДанныеШтрихкода, СтрокаТЧ);
			
			ДанныеПоШтрихкодам.Добавить(ДанныеШтрихкода);
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДанныеПоШтрихкодам;
	
КонецФункции

&НаСервере
Функция ДанныеШтрихкодаПоУмолчанию()
	
	ДанныеПоШтрихкоду = Новый Структура;
	ДанныеПоШтрихкоду.Вставить("Зарегистрирован",			Ложь);
	ДанныеПоШтрихкоду.Вставить("ЗарегистрированОбработкой",	Ложь);
	ДанныеПоШтрихкоду.Вставить("Штрихкод",					"");
	ДанныеПоШтрихкоду.Вставить("Номенклатура",				Справочники.Номенклатура.ПустаяСсылка());
	ДанныеПоШтрихкоду.Вставить("Характеристика",			Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	ДанныеПоШтрихкоду.Вставить("Серия",						Справочники.СерииНоменклатуры.ПустаяСсылка());
	ДанныеПоШтрихкоду.Вставить("Упаковка",					Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
	ДанныеПоШтрихкоду.Вставить("Количество",				0);
	
	Возврат ДанныеПоШтрихкоду;
	
КонецФункции

&НаКлиенте
Процедура ОчиститьШтрихкодыНоменклатурыДляПараметровЗакрытия(РежимУказанияШтрихкода)
	
	Если Не РежимУказанияШтрихкода Тогда
		Возврат;
	КонецЕсли;
	
	ШтрихкодыНоменклатуры.Очистить();
	
КонецПроцедуры

#КонецОбласти
